Autodesk.Revit.DB.Dimension.IsTextPositionAdjustable
Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.ResetTextPosition
Resets the text position of the dimension to the initial position determined by its type and parameters.
Remarks:
The initial point is the text position determined by the type and parameters of the dimension.
This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding method of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.IsValid
Indicates if this dimension is valid.
Remarks:
This property always returns true for model dimensions.
It can return false for view-specific dimensions that are hidden
because they are in an invalid state. An example of an invalid
state is having misaligned references for an aligned dimension.
Since:
2019

Autodesk.Revit.DB.Dimension.AreReferencesAvailable
Indicates if this dimension's references can be resolved.
Remarks:
This property always returns true for model dimensions.
It can return false for view-specific dimensions that can lose their
references in certain situations. For example, the host element
references may not be available when the view containing the
dimension is closed. In general, if the host element view-specific
geometry is not available, dimensions that reference that geometry
will not be able to resolve their references.
Since:
2019

Autodesk.Revit.DB.Dimension.TextPosition
The position of the dimension text's drag point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot dimensions, multi-segments dimensions
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property returns NULL
and will not allow setting a value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.Origin
The dimension origin.
Remarks:
The origin is the middle point of the dimension line that makes up the dimension.
This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding property of the
DimensionSegment class.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.LeaderEndPosition
The position of the dimension's leader end point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot dimensions, multi-segments dimensions
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property returns NULL
and will not allow setting a value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.MultiReferenceAnnotationId
The multi-reference annotation which owns this dimension.
InvalidElementId if this dimension is not part of a multi-reference annotation.
Since: 2014

Autodesk.Revit.DB.Dimension.ValueOverride
The text that replaces the segment's value.
Remarks: This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Below
The text shown below the segment's value.
Remarks: This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Above
The text shown above the segment's value.
Remarks: This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Suffix
The text shown after the segment's value.
Remarks: This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Prefix
The text shown before the segment's value.
Remarks: This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.IsLocked
Indicates if this dimension is locked.
Remarks:  This property always returns false if the dimension
is a radial or spot dimension.
This property cannot be set if the dimension has been labeled,
or if the dimension shape is arc-length, radial, diameter or spot,
or if the dimension is linear with more than one segment.

Autodesk.Revit.DB.Dimension.ValueString
The dimension value as a user visible string.
Remarks:  This property always return null if this is a spot dimension,
or it is a linear dimension with more than one segments.

Autodesk.Revit.DB.Dimension.Value
The value of the dimension.
Remarks:  This nullable property will not have a value for spot dimensions
or for linear dimensions with more than one segment.

Autodesk.Revit.DB.Dimension.AreSegmentsEqual
Indicates if all segments are forced to be equal.
Remarks: This property is usable only for linear dimensions with more
than one segment.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the dimension is non-linear or has only one segment.

Autodesk.Revit.DB.Dimension.Segments
The segments in the dimension.
Remarks: Returns a read only array of segments in the dimension.
The references of the dimension can be mapped to segments in order.
The first segment here wrapped by first and second references;
the nth segment is wrapped by nth and n+1st references.

Autodesk.Revit.DB.Dimension.NumberOfSegments
The number of segments for the dimension.

Autodesk.Revit.DB.Dimension.DimensionShape
The shape of this dimension.

Autodesk.Revit.DB.Dimension.FamilyLabel
The family parameter label of the dimension.
Remarks: A dimension only can be labeled to a family parameter in a family document.
When the dimension is labeled by a reporting parameter, the dimension value drives the parameter value.
When the parameter is labeled by a non-reporting, the value of the parameter drives the dimension.
If the dimension is multi-segmented, each segment of the dimension is driven by the same parameter value.
Multi-segmented dimensions cannot be labeled by reporting parameters.
To unbind the family parameter, set this property to null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the family parameter's ParameterType is not suitable for this dimension.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when dimension can not be labeled.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to get the BuiltInParameter DIM_LABEL.
Since: 2014

Autodesk.Revit.DB.Dimension.Name
Retrieves or changes the name associated with the Dimension.
Remarks: The property inherited from element is hidden, a System.InvalidOperationException
is thrown.

Autodesk.Revit.DB.Dimension.DimensionType
The dimension style of this dimension.

Autodesk.Revit.DB.Dimension.View
Supplies the view that contains the dimension if the dimension is view specific.

Autodesk.Revit.DB.Dimension.Curve
A curve that represents the dimension line.

Autodesk.Revit.DB.Dimension.References
Returns an array of geometric references to which the dimension is attached.

Autodesk.Revit.DB.Dimension
An object that represents a dimension within the Revit project.